---
kind: method
id: M:Autodesk.Revit.DB.TemporaryViewModes.RemoveCustomization
source: html/af568f76-72cd-ee0a-ab1d-b1bd13f2daf2.htm
---
# Autodesk.Revit.DB.TemporaryViewModes.RemoveCustomization Method

Removes all customized values for the TemporaryViewProperties mode.

## Syntax (C#)
```csharp
public void RemoveCustomization()
```